import pandas as pd
import random
import string

# 生成随机字符串工号

LAST_NAME = ["赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤",
             "许", "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水",
             "窦", "章", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞",
             "任", "袁", "柳", "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷", "罗", "毕",
             "郝", "邬", "安", "常", "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平",
             "黄", "和", "穆", "萧", "尹", "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", "明", "臧", "计", "伏",
             "成", "戴", "谈", "宋", "茅", "庞", "熊", "纪", "舒", "屈", "项", "祝", "董", "梁", "杜", "阮", "蓝", "闵", "席",
             "季", "麻", "强", "贾", "路", "娄", "危", "江", "童", "颜", "郭", "梅", "盛", "林", "刁", "钟", "徐", "邱", "骆",
             "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍", "虞", "万", "支", "柯", "昝", "管", "卢", "莫", "经", "房", "裘",
             "缪", "干", "解", "应", "宗", "丁", "宣", "贲", "邓", "郁", "单", "杭", "洪", "包", "诸", "左", "石", "崔", "吉",
             "钮", "龚", "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁", "荀", "羊", "於", "惠", "甄", "魏", "加", "封", "芮",
             "羿", "储", "靳", "汲", "邴", "糜", "松", "井", "段", "富", "巫", "乌", "焦", "巴", "弓", "牧", "隗", "山", "谷",
             "车", "侯", "宓", "蓬", "全", "郗", "班", "仰", "秋", "仲", "伊", "宫", "宁", "仇", "栾", "暴", "甘", "钭", "厉",
             "戎", "祖", "武", "符", "刘", "景", "詹", "束", "龙", "叶", "幸", "司", "韶", "郜", "黎", "蓟", "薄", "印", "宿",
             "白", "怀", "蒲", "邰", "从", "鄂", "索", "咸", "籍", "赖", "卓", "蔺", "屠", "蒙", "池", "乔", "阴", "郁", "胥",
             "能", "苍", "双", "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄", "姬", "申", "扶", "堵", "冉", "宰", "郦", "雍",
             "却", "璩", "桑", "桂", "濮", "牛", "寿", "通", "边", "扈", "燕", "冀", "郏", "浦", "尚", "农", "温", "别", "庄",
             "晏", "柴", "瞿", "阎", "充", "慕", "连", "茹", "习", "宦", "艾", "鱼", "容", "向", "古", "易", "慎", "戈", "廖",
             "庚", "终", "暨", "居", "衡", "步", "都", "耿", "满", "弘", "匡", "国", "文", "寇", "广", "禄", "阙", "东", "欧",
             "殳", "沃", "利", "蔚", "越", "夔", "隆", "师", "巩", "厍", "聂", "晁", "勾", "敖", "融", "冷", "辛", "那", "简",
             "饶", "空", "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰", "巢", "关", "蒯", "相", "查", "后", "荆", "红", "游",
             "竺", "权", "逯", "盖", "益", "桓", "公", "粱"]

FAMILF_NAME = ["安", "昂", "宝", "北", "贝", "奔", "彬", "斌", "波", "博", "才", "灿", "岑", "晨", "成", "承", "初", "楚", "存",
               "达", "德", "得", "德", "登", "迪", "东", "冬", "栋", "都", "端", "鹅", "恩", "尔", "飞", "凡", "帆", "方", "风",
               "枫", "峰", "锋", "夫", "福", "富", "刚", "高", "戈", "歌", "格", "根", "耕", "功", "广", "贵", "国", "海", "寒",
               "翰", "汉", "行", "豪", "浩", "合", "和", "弘", "红", "宏", "洪", "虎", "华", "化", "欢", "黄", "辉", "会", "鸿",
               "吉", "佳", "家", "嘉", "剑", "坚", "健", "江", "杰", "洁", "金", "晋", "锦", "劲", "进", "菊", "举", "军", "峻",
               "凯", "楷", "康", "可", "克", "坤", "昆", "来", "浪", "乐", "雷", "黎", "立", "力", "丽", "利", "立", "良", "亮",
               "林", "琳", "龙", "隆", "楼", "露", "陆", "路", "旅", "伦", "纶", "罗", "洛", "玛", "马", "满", "茂", "梅", "美",
               "猛", "敏", "明", "铭", "鸣", "那", "南", "楠", "能", "宁", "农", "浓", "盼", "培", "鹏", "平", "奇", "琪", "启",
               "千", "乔", "秋", "全", "荣", "儒", "如", "瑞", "睿", "山", "善", "尚", "绍", "深", "胜", "晟", "师", "诗", "书",
               "舒", "双", "水", "顺", "思", "松", "嵩", "锁", "涛", "腾", "天", "亭", "庭", "挺", "彤", "统", "万", "威", "伟",
               "维", "伟", "温", "文", "闻", "问", "翁", "武", "西", "熙", "玺", "仙", "先", "贤", "祥", "小", "晓", "效", "心",
               "新", "信", "星", "兴", "秀", "续", "旭", "宣", "学", "雪", "寻", "熊", "修", "徐", "旋", "选", "雅", "亚", "阳",
               "洋", "扬", "耀", "叶", "业", "义", "益", "艺", "意", "宜", "毅", "怡", "银", "英", "盈", "萤", "颖", "永", "勇",
               "咏", "友", "宇", "禹", "宇", "羽", "雨", "语", "宇", "玉", "豫", "元", "远", "月", "岳", "云", "运", "允", "泽",
               "扎", "在", "展", "战", "章", "长", "招", "昭", "钊", "兆", "哲", "贞", "振", "正", "政", "郑", "之", "中", "忠",
               "钟", "舟", "周", "朱", "珠", "诸", "烛", "竹", "主", "壮", "卓", "子", "梓", "紫", "宗", "昨", "左", "佐", "祖",]


def generate_employee_id():
    return ''.join(random.choices(string.digits, k=10))

# 生成随机汉字姓名


def generate_employee_name():
    last_name = random.randint(0, len(LAST_NAME)-1)
    family_name = random.randint(0, len(FAMILF_NAME)-1)
    n = random.random()
    if n >= 0.5:
        family_name_2 = random.randint(0, len(FAMILF_NAME)-1)
        return f"{LAST_NAME[last_name]}{FAMILF_NAME[family_name]}{FAMILF_NAME[family_name_2]}"
    return f"{LAST_NAME[last_name]}{FAMILF_NAME[family_name]}"


# 创建 DataFrame
data = {'工号': [generate_employee_id() for _ in range(200)],
        '姓名': [generate_employee_name() for _ in range(200)]}
df = pd.DataFrame(data)

# 导出到 Excel
df.to_excel('employee_data.xlsx', index=False)
